app/Http/Controllers/StudentController.php

select * from `students` where `user_id` = 1 limit 1
---
    public function get_pre_registration()
    {
        // TODO: replace this foreach with a api resource collection
        $studentSubmittedCompany = Company::where('student_id', Auth::user()->student->id)->first();
        $x = [
            // ! one of the most complicated queries of this project
            // ? this query's problem was i couldn't get the user and i needed to send a query to the database to get user for every employee
            'faculties' => preRegFacultiesWithMasters::collection(University_faculty::with(['employees' => function ($query) {
                $query->whereHas('user', function ($query2) {
                    $query2->role('master');
                });
            }])->get()),
            'companies' => CompanyResource::collection(Company::where('verified', true)->get()),
            'student_company' => isset($studentSubmittedCompany) ? StudentSubmittedCompanyResource::make($studentSubmittedCompany) : null,
            'academic_year' => [
                'semester' => 'نیم سال اول',
                'year' => '1401',
            ]
        ];